[
  {
    "id": 1,
    "name": "The Temple Of Mota",
    "description": "You are in the southern end of the temple hall in the Temple of Mota. The temple has been constructed from giant marble blocks, eternal in appearance, and most of the walls are covered by ancient wall paintings picturing gods, giants and peasants.    Large steps lead down through the grand temple gate, descending the huge mound upon which the temple is built and ends on the temple square below.    Equally large steps lead UP through a small door into the ENTRANCE to MUD  SCHOOL.  (type 'up' to go to MUD SCHOOL.)  A small plaque is on this wall. ",
    "south": 5,
    "north": 54,
    "east": null,
    "west": null,
    "item": 5,
    "starting": true
  },
  {
    "id": 2,
    "name": "Cleric's Inner Sanctum",
    "description": "This is the inner sanctum.  A picture of the mighty Mota is hanging on the wall, just above the altar which is set against the western wall.  A well in the middle of the floor leads down into darkness.  Vile smells waft from the depths. ",
    "south": null,
    "north": null,
    "east": 3,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 3,
    "name": "Cleric's Bar",
    "description": "The bar is one of the finest in the land, lucky it is members only.  Fine furniture is set all around the room.  A small sign is hanging on the wall. ",
    "south": 4,
    "north": null,
    "east": null,
    "west": 2,
    "item": 22,
    "starting": false
  },
  {
    "id": 4,
    "name": "Entrance to Cleric's Guild",
    "description": "The entrance hall is a small modest room, reflecting the true nature of the Clerics.  The exit leads east to the temple square.  A small entrance to the bar is in the northern wall. ",
    "south": null,
    "north": 3,
    "east": 5,
    "west": null,
    "item": 365,
    "starting": false
  },
  {
    "id": 5,
    "name": "The Temple Square",
    "description": "You are standing on the temple square.  Huge marble steps lead up to the temple gate.  The entrance to the Clerics Guild is to the west, and the old Grunting Boar Inn, is to the east.  Just south of here you see the market square, the center of Midgaard. ",
    "south": 14,
    "north": 1,
    "east": 6,
    "west": 4,
    "item": 135,
    "starting": false
  },
  {
    "id": 6,
    "name": "Entrance to the Grunting Boar Inn",
    "description": "You are standing in the entrance hall of the Grunting Boar Inn.  The hall has been wisely decorated with simple but functional furniture.  A small staircase leads up to the bedroom area and the bar is to the east. ",
    "south": null,
    "north": null,
    "east": 7,
    "west": 5,
    "item": null,
    "starting": false
  },
  {
    "id": 7,
    "name": "The Grunting Boar",
    "description": "You are standing in the bar.  The bar is set against the northern wall, old archaic writing, carvings and symbols cover its top.  A fireplace is built into the western wall, and through the southeastern windows you can see the temple square.  This place makes you feel like home. A small sign with big letters is fastened to the bar. ",
    "south": null,
    "north": null,
    "east": null,
    "west": 6,
    "item": 22,
    "starting": false
  },
  {
    "id": 8,
    "name": "The Bedroom Area",
    "description": "Need some rest? Sleep in one of our many beds! The staircase leads down to the entrance hall. ",
    "south": null,
    "north": null,
    "east": null,
    "west": null,
    "item": 155,
    "starting": false
  },
  {
    "id": 9,
    "name": "The Bakery",
    "description": "You are standing inside the small bakery.  A sweet scent of Danish and fine bread fills the room.  The bread and Danish are arranged in fine order on the shelves, and seem to be of the finest quality. A small sign is on the counter. ",
    "south": 13,
    "north": null,
    "east": null,
    "west": null,
    "item": 22,
    "starting": false
  },
  {
    "id": 10,
    "name": "The General Store",
    "description": "You are inside the general store.  All sorts of items are stacked on shelves behind the counter, safely out of your reach. A small note hangs on the wall. ",
    "south": 15,
    "north": null,
    "east": null,
    "west": null,
    "item": 22,
    "starting": false
  },
  {
    "id": 11,
    "name": "The Weapon Shop",
    "description": "You are inside the weapon shop.  There is a small note on the counter. ",
    "south": 16,
    "north": null,
    "east": null,
    "west": null,
    "item": 22,
    "starting": false
  },
  {
    "id": 12,
    "name": "Main Street",
    "description": "You are at the end of the main street of Midgaard.  South of here is the entrance to the Guild of Magic Users.  The street continues east towards the market square.  The magic shop is to the north and to the west is the city gate. ",
    "south": 17,
    "north": 33,
    "east": 13,
    "west": 40,
    "item": null,
    "starting": false
  },
  {
    "id": 13,
    "name": "Main Street",
    "description": "You are on the main street passing through the City of Midgaard.  South of here is the entrance to the Armoury, and the bakery is to the north.  East of here is the market square. ",
    "south": 20,
    "north": 9,
    "east": 14,
    "west": 12,
    "item": null,
    "starting": false
  },
  {
    "id": 14,
    "name": "Market Square",
    "description": "You are standing on the market square, the famous Square of Midgaard. A large, peculiar looking statue is standing in the middle of the square. Roads lead in every direction, north to the temple square, south to the common square, east and westbound is the main street. ",
    "south": 25,
    "north": 5,
    "east": 15,
    "west": 13,
    "item": 365,
    "starting": false
  },
  {
    "id": 15,
    "name": "The Main Street",
    "description": "You are on Main Street crossing through town.  To the north is the general store, and the main street continues east.  To the west you see and hear the market place and to the south is the Jeweller's Shop. ",
    "south": 320,
    "north": 10,
    "east": 16,
    "west": 14,
    "item": null,
    "starting": false
  },
  {
    "id": 16,
    "name": "The Main Street",
    "description": "The main street, to the north is the weapon shop and to the south is the Guild of Swordsmen.  To the east you leave town and to the west the street leads to the market square. ",
    "south": 321,
    "north": 11,
    "east": 41,
    "west": 15,
    "item": null,
    "starting": false
  },
  {
    "id": 17,
    "name": "Entrance to Mage's Guild",
    "description": "The entrance hall is a small, poor lighted room. ",
    "south": 18,
    "north": 12,
    "east": null,
    "west": null,
    "item": 365,
    "starting": false
  },
  {
    "id": 18,
    "name": "Mage's Bar",
    "description": "The bar is one of the wierdest in the land.  Mystical images float around the air.  Illusions of fine furniture appear all around the room. ",
    "south": null,
    "north": 17,
    "east": 19,
    "west": null,
    "item": 22,
    "starting": false
  },
  {
    "id": 19,
    "name": "Mage's Laboratory",
    "description": "This is the Magical Experiments Laboratory.  Dark smoke-stained stones arch over numerous huge oaken tables, most of these cluttered with strange- looking pipes and flasks.  The floor is covered with half-erased pentagrams and even weirder symbols, and a blackboard in a dark corner has only been partially cleaned, some painful-looking letters faintly visible.  A well in the middle of the floor leads down into darkness.  Vile smells waft from the depths. ",
    "south": null,
    "north": null,
    "east": null,
    "west": 18,
    "item": null,
    "starting": false
  },
  {
    "id": 20,
    "name": "The Armoury",
    "description": "The armoury with all kinds of armours on the walls and in the window.  You see helmets, shields and chain mails.  To the north is the main street. On the wall is a small note. ",
    "south": null,
    "north": 13,
    "east": null,
    "west": null,
    "item": 22,
    "starting": false
  },
  {
    "id": 21,
    "name": "Entrance Hall to the Guild of Swordsmen",
    "description": "The entrance hall to the Guild of Swordsmen.  A place where one has to be careful not to say something wrong (or right).  To the east is the bar and to the north is the main street. ",
    "south": null,
    "north": 16,
    "east": 22,
    "west": null,
    "item": 357,
    "starting": false
  },
  {
    "id": 22,
    "name": "The Bar of Swordsmen",
    "description": "The bar of swordsmen, once upon a time beautifully furnished.  But now the furniture is all around you in small pieces.  To the south is the yard, and to the west is the entrance hall. ",
    "south": 23,
    "north": null,
    "east": null,
    "west": 21,
    "item": 22,
    "starting": false
  },
  {
    "id": 23,
    "name": "The Tournament and Practice Yard",
    "description": "The practice yard of the fighters.  To the north is the bar.  A well leads down into darkness. ",
    "south": null,
    "north": 22,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 24,
    "name": "Eastern End of Poor Alley",
    "description": "You are at the poor alley. South of here is the Grubby Inn and to the east you see common square. Melancholy's map shop is north. The alley continues  further west. ",
    "south": 48,
    "north": 160,
    "east": 25,
    "west": 44,
    "item": null,
    "starting": false
  },
  {
    "id": 25,
    "name": "The Common Square",
    "description": "The common square, people pass you, talking to each other.  To the west is the poor alley and to the east is the dark alley.  To the north, this square is connected to the market square.  From the south you notice a nasty smell. ",
    "south": 30,
    "north": 14,
    "east": 26,
    "west": 24,
    "item": null,
    "starting": false
  },
  {
    "id": 26,
    "name": "The Dark Alley",
    "description": "The dark alley, to the west is the common square and to the south is the Guild of Thieves.  Grebe's Tavern, the famous sailor's dive, is north. The alley continues east. ",
    "south": 27,
    "north": 330,
    "east": 45,
    "west": 25,
    "item": 21,
    "starting": false
  },
  {
    "id": 27,
    "name": "Entrance Hall to the Guild of Thieves",
    "description": "The entrance hall to the thieves' and assassins' guild.  A place where you can lose both your life and your money, if you are not careful.  To the north is the dark alley and to the east is the thieves' bar. ",
    "south": null,
    "north": 26,
    "east": 28,
    "west": null,
    "item": 357,
    "starting": false
  },
  {
    "id": 28,
    "name": "The Thieves Bar",
    "description": "The bar of the thieves.  Once upon a time this place was beautifully furnished, but now it seems almost empty.  To the south is the yard, and to the west is the entrance hall.    (Maybe the furniture has been stolen?!) ",
    "south": 29,
    "north": null,
    "east": null,
    "west": 27,
    "item": 22,
    "starting": false
  },
  {
    "id": 29,
    "name": "The Secret Yard",
    "description": "The secret practice yard of thieves and assassins.  To the north is the bar.  A well leads down into darkness. ",
    "south": null,
    "north": 28,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 30,
    "name": "The Dump",
    "description": "The dump, where the people from the city drop their garbage.  Through the garbage you can see a large junction of pipes, looks like the entrance to the sewer system.  South of here you see the river and to the north is the common square.  A rickety old bridge leads south to the promenade. ",
    "south": 254,
    "north": 25,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 31,
    "name": "The Pet Shop",
    "description": "The Pet Shop is a small crowded store, full of cages and animals of various sorts and sizes.  There is a sign on the wall. ",
    "south": 45,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 32,
    "name": "Pet Shop Store",
    "description": "This is the small dark room in which the Pet Shop Boy keeps his pets. It is vital that this room be immediately after the pet shop. ",
    "south": null,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 33,
    "name": "The Magic Shop",
    "description": "You are in a small room that smells of rare chemicals and spices. Dividing the room in two is a large desk, and on the wall behind it are numerous shelves crammed with jars, bottles, books and scrolls of all sorts and sizes. ",
    "south": 12,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 34,
    "name": "The Jeweller's Shop",
    "description": "You are in a small, beautifully furnished room.  The warm light emanating from the small oil lamps on the walls is reflected in the hard, polished surface of the big mahogany desk that stands in the centre of the room. A small sign with golden letters stands on the desk. ",
    "south": null,
    "north": 15,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 35,
    "name": "The Leather Shop",
    "description": "An acrid smell fills this large room.  Along the walls are numerous shelves containing all sorts of animal hide and in the crackling fireplace hangs a big iron pot with boiling water.  In the middle of the room is a large oak table. A wooden sign is hanging above the fireplace. ",
    "south": 44,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 40,
    "name": "Inside the West Gate of Midgaard",
    "description": "You are by two small towers that have been built into the city wall and connected with a footbridge across the heavy wooden gate.  Main Street leads east and Wall Road leads both north and south from here. ",
    "south": 42,
    "north": 257,
    "east": 12,
    "west": 52,
    "item": 365,
    "starting": false
  },
  {
    "id": 41,
    "name": "Inside the East Gate of Midgaard",
    "description": "You are by two small towers that have been built into the city wall and connected with a footbridge across the heavy wooden gate.  Main Street leads west from here.  Wall road crosses the street, heading north and south along the city wall. ",
    "south": 250,
    "north": 267,
    "east": 53,
    "west": 16,
    "item": 365,
    "starting": false
  },
  {
    "id": 42,
    "name": "Wall Road",
    "description": "You are walking next to the western city wall.  The road continues further south and the city gate is just north of here. ",
    "south": 43,
    "north": 40,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 43,
    "name": "Wall Road",
    "description": "You are walking next to the western city wall.  Wall Road continues further north and south.  A small, poor alley leads east. Some letters have been written on the wall here. ",
    "south": 47,
    "north": 42,
    "east": 44,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 44,
    "name": "Poor Alley",
    "description": "You are in narrow and dirty alley leading east and west.  The leather shop is to the north. ",
    "south": 170,
    "north": 35,
    "east": 24,
    "west": 43,
    "item": null,
    "starting": false
  },
  {
    "id": 45,
    "name": "Alley at Levee",
    "description": "You are standing in the alley which continues east and west.  South of here you see the levee.  North is the Pet Shop. ",
    "south": 49,
    "north": 31,
    "east": 46,
    "west": 26,
    "item": null,
    "starting": false
  },
  {
    "id": 46,
    "name": "Eastern end of Alley",
    "description": "You are standing at the eastern end of the alley,  near the city walls.   Wall road loops around the city to your east, and you can see an old  three-story warehouse to the south.  The Fountain of Youth Apothecary is  north. ",
    "south": 50,
    "north": 56,
    "east": 251,
    "west": 45,
    "item": null,
    "starting": false
  },
  {
    "id": 47,
    "name": "Wall Road",
    "description": "You are standing on the road next to the western city wall which continues north.  South of here is a bridge across the river.  To the east, you see an odd looking building painted bright orange with purple trim... it must be the Mob Factory! ",
    "south": 51,
    "north": 43,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 48,
    "name": "Grubby Inn",
    "description": "You are inside the old Grubby Inn.  This place has not been cleaned for several decades, vile smells make you dizzy. ",
    "south": null,
    "north": 24,
    "east": null,
    "west": null,
    "item": 22,
    "starting": false
  },
  {
    "id": 49,
    "name": "Levee",
    "description": "You are at the levee.  South of here you see the river gently flowing west. The river bank is very low making it possible to enter the river.  Directly across the river you can see a small boat landing built off of Kate's Diner. ",
    "south": 203,
    "north": 45,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 50,
    "name": "Abandoned Warehouse",
    "description": "You are inside the only room in the old warehouse.  The place is very dusty and appears to have been unused for many years.  The skylight spills violet-tinged light. ",
    "south": null,
    "north": 46,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 51,
    "name": "On the Bridge",
    "description": "You are standing on the stone bridge crosses the river.  The bridge is built out from the western city wall and the river flows west through an opening in the wall ten feet below the bridge. ",
    "south": 100,
    "north": 47,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 52,
    "name": "Outside the West Gate of Midgaard",
    "description": "You are by two small towers that have been built into the city wall and connected with a footbridge across the heavy wooden gate.  To the west you can see the edge of a big forest. A small dusty trail leads north along the wall. ",
    "south": null,
    "north": null,
    "east": 40,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 53,
    "name": "Outside the East Gate of Midgaard",
    "description": "You are by two small towers that have been built into the city wall and connected with a footbridge across the heavy wooden gate.  To the east the plains stretch out in the distance. To the north a small dusty trail follow the city wall. ",
    "south": null,
    "north": null,
    "east": null,
    "west": 41,
    "item": null,
    "starting": false
  },
  {
    "id": 54,
    "name": "By the Temple Altar",
    "description": "You are by the temple altar in the northern end of the Temple of Mota. A huge altar made from white polished marble is standing in front of you and behind it is a ten foot tall sitting statue of Odin, the King of the Gods. The back of the altar opens into a a beautiful atrium, above which can be seen a rainbow. ",
    "south": 1,
    "north": null,
    "east": null,
    "west": null,
    "item": 10,
    "starting": false
  },
  {
    "id": 56,
    "name": "The Fountain of Youth Apothecary",
    "description": "An old man putters around behind the counter, making strange love potions and curative philtres.  He turns as you enter, and looks on with avarice. Judging from the furnishings, he's been made very wealthy by his trade. ",
    "south": 46,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 57,
    "name": "In the air...",
    "description": "WOW you can fly!  You are floating in the air above Temple Square of Midgaard. ",
    "south": null,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 100,
    "name": "Northwest end of Concourse",
    "description": "You are at the concourse, the city wall is just west.  A small promenade goes east, and the bridge is just north of here.  The concourse continues south along the city wall. ",
    "south": 270,
    "north": 51,
    "east": 101,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 101,
    "name": "Promenade",
    "description": "The river gently flows west just north of here.  The promenade continues further east and to the west you see the city wall.  Park Road leads south from here. ",
    "south": 131,
    "north": null,
    "east": 102,
    "west": 100,
    "item": 134,
    "starting": false
  },
  {
    "id": 102,
    "name": "Promenade",
    "description": "The river gently flows west just north of here.  The promenade continues both east and west.  A rickety bridge crosses the river to the north, towards the city dump (fortunately, the wind is blowing towards the dump today).  South of here you see the entrance to the park, and a small building seems to be just west of the entrance.  Austral Square, home of Kate's Diner, lies to your east. ",
    "south": 105,
    "north": 254,
    "east": 103,
    "west": 101,
    "item": 134,
    "starting": false
  },
  {
    "id": 103,
    "name": "Austral Square",
    "description": "The Promenade opens here onto Austral Square, on the south bank of the Midgaard River.  All around you is the bustle of Southern Midgaard-- shopkeepers on break, a town gossip or two prattling away.  You hear the river lapping at the pilings of the dock by Kate's Diner, which is to your north.  Emerald Avenue begins to the south, the Promenade continues west, and the concourse ends to your east. ",
    "south": 132,
    "north": 150,
    "east": 104,
    "west": 102,
    "item": 134,
    "starting": false
  },
  {
    "id": 104,
    "name": "Northeast end of Concourse",
    "description": "You are at the Concourse.  The city wall is just east and Austral Square, home of Kate's Diner, is west.  Looking across the river you see an old   warehouse.  A strong stone bridge crosses the river to the north, where the concourse becomes wall road.  The Concourse continues south along the wall. ",
    "south": 272,
    "north": 253,
    "east": null,
    "west": 103,
    "item": null,
    "starting": false
  },
  {
    "id": 105,
    "name": "Park Entrance",
    "description": "You are standing just inside the small park of Midgaard.  To the north is the promenade and a small path leads south into the park.  To your east is the famous Park Cafe. ",
    "south": 108,
    "north": 102,
    "east": 106,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 106,
    "name": "Park Cafe",
    "description": "You are inside Park Cafe, a very well lighted, cosy place. The cafe is built from large logs. Through the windows in the northern wall you see the river, and through the southern window you see many vigorous colorful plants. ",
    "south": null,
    "north": null,
    "east": null,
    "west": 105,
    "item": 200,
    "starting": false
  },
  {
    "id": 107,
    "name": "Small path through the park",
    "description": "You are walking along a small path through the park.  The path continues south and east. ",
    "south": 113,
    "north": null,
    "east": 108,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 108,
    "name": "Small path in the park",
    "description": "You are standing on a small path inside the park.  The park entrance is just north of here, and Park Cafe is just east of the entrance.  The path leads further east and west. ",
    "south": null,
    "north": 105,
    "east": 109,
    "west": 107,
    "item": null,
    "starting": false
  },
  {
    "id": 109,
    "name": "Small path in the park",
    "description": "You are on a small path running through the park.  It continues west and south and just north of here you see the southern wall of Park Cafe. ",
    "south": 115,
    "north": null,
    "east": null,
    "west": 108,
    "item": 365,
    "starting": false
  },
  {
    "id": 110,
    "name": "Cityguard Head Quarters",
    "description": "You are inside a tidy office.  A big desk made from dark wood is standing in the centre of the room. ",
    "south": null,
    "north": null,
    "east": 111,
    "west": 142,
    "item": null,
    "starting": false
  },
  {
    "id": 111,
    "name": "Park Road",
    "description": "The road continues north and south.  A building is just west of here, you notice a sign on the door.  The park entrance is to the east. ",
    "south": 118,
    "north": 131,
    "east": 112,
    "west": 110,
    "item": 365,
    "starting": false
  },
  {
    "id": 112,
    "name": "Western Park Entrance",
    "description": "You are standing at the western end of the park.  A small path leads east into the park and going west through the entrance you will reach Park Road. ",
    "south": null,
    "north": null,
    "east": 113,
    "west": 111,
    "item": null,
    "starting": false
  },
  {
    "id": 113,
    "name": "A path in the park",
    "description": "You are in the park.  The paths lead north and west.  Westwards is the park entrance and to the east you see a small pond. ",
    "south": null,
    "north": 107,
    "east": 114,
    "west": 112,
    "item": null,
    "starting": false
  },
  {
    "id": 114,
    "name": "The Pond",
    "description": "You are swimming around in the pond, feeling rather stupid.  You can get back on the path from the eastern and western end of the pond. ",
    "south": null,
    "north": null,
    "east": 115,
    "west": 113,
    "item": null,
    "starting": false
  },
  {
    "id": 115,
    "name": "A path in the park",
    "description": "You are in the park.  The paths lead north and east.  Eastwards is the park entrance and to the west you see a small pond. ",
    "south": null,
    "north": 109,
    "east": 116,
    "west": 114,
    "item": null,
    "starting": false
  },
  {
    "id": 116,
    "name": "Eastern Park Entrance",
    "description": "You are standing at the eastern end of the park.  A small path leads west into the park.  Going east through the entrance you will reach Emerald Avenue. ",
    "south": null,
    "north": null,
    "east": 117,
    "west": 115,
    "item": null,
    "starting": false
  },
  {
    "id": 117,
    "name": "Emerald Avenue",
    "description": "You are at Emerald Avenue which continues north and south.  To the west is the park entrance and to the east is the not very big Town Hall of Midgaard. ",
    "south": 119,
    "north": 132,
    "east": 137,
    "west": 116,
    "item": 365,
    "starting": false
  },
  {
    "id": 118,
    "name": "Park Road",
    "description": "You are on Park Road which leads north and south. ",
    "south": 135,
    "north": 111,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 119,
    "name": "Emerald Avenue",
    "description": "You are standing at a bend on Emerald Avenue.  The road leads north and west. To the east, you see some run-down slums...it looks like the bad part of town. ",
    "south": null,
    "north": 117,
    "east": null,
    "west": 133,
    "item": null,
    "starting": false
  },
  {
    "id": 120,
    "name": "Road Crossing",
    "description": "You are in the middle of the road cross.  Roads lead in all directions. A huge black iron chain as thick as a tree trunk is fastened into the ground at the centre of the road cross.  Its other end leads directly upwards towards the sky. A road sign is here. ",
    "south": 134,
    "north": 133,
    "east": 136,
    "west": 135,
    "item": 365,
    "starting": false
  },
  {
    "id": 121,
    "name": "Emerald Avenue",
    "description": "You are standing at a bend on Emerald Avenue.  The road leads south and east. ",
    "south": 125,
    "north": null,
    "east": 134,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 122,
    "name": "Park Road",
    "description": "You are on Park Road which leads south and north.  Elm Street is east of here. ",
    "south": 126,
    "north": 136,
    "east": 123,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 123,
    "name": "Elm Street",
    "description": "You are on Elm street.  Park Road is to the west and Elm Street continues in eastward direction. ",
    "south": null,
    "north": null,
    "east": 124,
    "west": 122,
    "item": null,
    "starting": false
  },
  {
    "id": 124,
    "name": "Elm Street",
    "description": "You near the end of Elm Street.  An old elm tree grows here.  A heavy iron grating is south, surrounding the city's graveyard.  You can see a sign hanging on the grate.  The concourse joins Elm Street to the east, and the street ends to the north near a run-down neighborhood. ",
    "south": null,
    "north": 144,
    "east": 273,
    "west": 123,
    "item": null,
    "starting": false
  },
  {
    "id": 125,
    "name": "Emerald Avenue",
    "description": "You are on Emerald Avenue which continues north. The Concourse is south of here. ",
    "south": 128,
    "north": 121,
    "east": null,
    "west": null,
    "item": 365,
    "starting": false
  },
  {
    "id": 126,
    "name": "Park Road",
    "description": "You are on Park Road which continues north.  The Concourse is south of here. ",
    "south": 129,
    "north": 122,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 127,
    "name": "On the Concourse",
    "description": "You are at the southwest corner of the city wall.  The Concourse leads both north and east. ",
    "south": null,
    "north": 271,
    "east": 128,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 128,
    "name": "On the Concourse",
    "description": "You are walking around the scenic concourse as it continues its path around the city of Midgaard.  The south gate of the city lies to your east, and the  southwestern corner of the city wall is west.  Emerald Avenue stretches out to the north. ",
    "south": null,
    "north": 125,
    "east": 255,
    "west": 127,
    "item": 351,
    "starting": false
  },
  {
    "id": 129,
    "name": "On the Concourse",
    "description": "The concourse continues its path around the city.  The southern gates of the city are west of here, and park road lies north.  The northeastern corner of the city wall is east. ",
    "south": null,
    "north": 126,
    "east": 130,
    "west": 255,
    "item": null,
    "starting": false
  },
  {
    "id": 130,
    "name": "On the Concourse",
    "description": "You are at the southeast corner of the city wall.  The Concourse leads both north and west. ",
    "south": null,
    "north": 273,
    "east": null,
    "west": 129,
    "item": null,
    "starting": false
  },
  {
    "id": 131,
    "name": "Park Road",
    "description": "You are at Park Road which continues north and south. ",
    "south": 111,
    "north": 101,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 132,
    "name": "Emerald Avenue",
    "description": "You are standing on the north end of Emerald Avenue.  To the north is  Austral Square and Kate's Diner, to the east is the small street Penny Lane. ",
    "south": 117,
    "north": 103,
    "east": 139,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 133,
    "name": "Emerald Avenue",
    "description": "You are standing at a bend on Emerald Avenue.  To the east the road goes on and to the south is the Road Crossing. ",
    "south": 120,
    "north": null,
    "east": 119,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 134,
    "name": "Emerald Avenue",
    "description": "You are standing at a bend on Emerald Avenue.  To the west the road goes on and to the north is the Road Crossing. ",
    "south": null,
    "north": 120,
    "east": null,
    "west": 121,
    "item": null,
    "starting": false
  },
  {
    "id": 135,
    "name": "Park Road",
    "description": "You are at a bend on Park Road.  To the north the road goes on and to the east is the Road Crossing.  To the south, the ancient cliffs rise from deep under the ground, forming a wall. ",
    "south": null,
    "north": 118,
    "east": 120,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 136,
    "name": "Park Road",
    "description": "You are at a bend on Park Road.  To the south the road goes on and to the west is the Road Crossing. ",
    "south": 122,
    "north": null,
    "east": null,
    "west": 120,
    "item": null,
    "starting": false
  },
  {
    "id": 137,
    "name": "The Waiting Room",
    "description": "You are standing in the waiting room at the town hall.  Wooden chairs stand along the walls and a long desk is placed in the middle of the room. ",
    "south": null,
    "north": null,
    "east": 138,
    "west": 117,
    "item": null,
    "starting": false
  },
  {
    "id": 138,
    "name": "The Mayor's Office",
    "description": "You are in the not very big office of the Mayor of Midgaard.  A large and polished but completely empty desk is standing in front of an armchair that looks so comfortable that it most of all resembles a bed with the head end raised slightly. ",
    "south": null,
    "north": null,
    "east": null,
    "west": 137,
    "item": 124,
    "starting": false
  },
  {
    "id": 139,
    "name": "Penny Lane",
    "description": "You are on Penny Lane.  Emerald Avenue is to the west and Penny Lane continues in eastward direction. ",
    "south": null,
    "north": null,
    "east": 140,
    "west": 132,
    "item": null,
    "starting": false
  },
  {
    "id": 140,
    "name": "Penny Lane",
    "description": "You are on Penny Lane.  The narrow road continues north and west, and the concourse intersects this street to the east. ",
    "south": null,
    "north": 141,
    "east": 272,
    "west": 139,
    "item": null,
    "starting": false
  },
  {
    "id": 141,
    "name": "The end of Penny Lane",
    "description": "You are at the end of Penny Lane.  The only exit appears to be south. ",
    "south": 140,
    "north": null,
    "east": null,
    "west": null,
    "item": 135,
    "starting": false
  },
  {
    "id": 142,
    "name": "Captain's Office",
    "description": "You are in the Office of the Captain of the Guard.  The Midgaard Coat of Arms is hanging on the north wall and a heavy steel door is to the south. ",
    "south": 143,
    "north": null,
    "east": 110,
    "west": null,
    "item": 350,
    "starting": false
  },
  {
    "id": 143,
    "name": "The Jail",
    "description": "You are in a dark and humid jail.  The dark stone walls are hard and cold to the touch.  A heavy steel door is to the north. ",
    "south": null,
    "north": 142,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 144,
    "name": "The end of Elm Street",
    "description": "Elm street ends here, next to a dangerous-looking run down neighborhood. You can enter the slums to the east, or head towards the graveyard to the south.  It occurs to you that this isn't the happiest section of town. ",
    "south": 124,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 150,
    "name": "Kate's Diner",
    "description": "The smells of baking bread and simmering stew lead you dancing through the doorway of the diner.  No greasy spoons to be seen here-- the booth walls are covered in casual paisleys; the chairs are carved wood, rescued from garage sales.  Most tables have chess or backgammon boards carved and painted on their fingertip-smooth tops.  The refrain of some musical or other from the 1930's blends with the dusty golden light and the wonderful smells to put you completely at ease.  A huge picture window looks out over the Midgaard River, and a doorway leads north onto the dock and the South Bank river landing, while the main entrance to the south returns you to Austral Square. On most days you will find Kate here, testing a batch of stew or brewing a special pot of cinnamon coffee, eerily just in time for your arrival Pull up a chair, perhaps play a game, and take time out to talk. ",
    "south": 103,
    "north": 203,
    "east": null,
    "west": null,
    "item": 200,
    "starting": false
  },
  {
    "id": 160,
    "name": "Melancholy's Maps",
    "description": "As you walk in, a sudden gust of wind enters the shop and sends several scraps of paper fly around the room.  You blink as the dust you've stirred  up stings your eyes, and take a look around the shop.  This shop is cluttered  with old pieces of parchment, stacks of books, and odd scraps.  A desk with  slightly less clutter than the rest of the shop is in front of you.  A scroll  case full of scrolls is behind the desk.  A bookcase is to the right of you,  and to the left is a window overlooking the Common Square.  A small door,  half hidden by a stack of books, leads to a room in the back of the shop. ",
    "south": 24,
    "north": 161,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 161,
    "name": "Melancholy's Room",
    "description": "A faint smell of incense teases your nose as you enter this room.  You  step onto a soft bearskin rug and look around.  A simple bed lies against the far wall.  At the foot of it is a sturdy, ironbound chest, most likely full of Melancholy's trappings from her adventuring days.  On a small table under a window to the east is a vase with a single white rose.  Other than that, the room is quite bare.   ",
    "south": 160,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 170,
    "name": "Temple Of Stupid",
    "description": "As you enter the abandoned warehouse your eyes blink violently to adjust to the almost total darkness.  You wonder where the windows are as you step into a mud puddle in the middle of the floor.  As your eyes adjust, you realize that there are mud puddles all around the room, and this is some weird version of windows.  In a flash of revelation, you realize that you've entered the Temple of Stupid. ",
    "south": null,
    "north": 44,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 200,
    "name": "Under the Bridge",
    "description": "The arch under the bridge is covered by seaweed for one foot above the surface of the river.  The water gently flows through an opening in the lower part of the city wall. ",
    "south": null,
    "north": null,
    "east": 201,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 201,
    "name": "On the River",
    "description": "North of here you see the miserable buildings of the poor alley.  The river flows west towards the bridge.  The riverbanks are too steep to climb. ",
    "south": null,
    "north": null,
    "east": 202,
    "west": 200,
    "item": null,
    "starting": false
  },
  {
    "id": 202,
    "name": "On the River",
    "description": "North of here you see the dump.  The river flows from east to west.  The riverbanks are too steep to climb.  A bridge passes overhead, connecting the dump to the promenade. ",
    "south": null,
    "north": null,
    "east": 203,
    "west": 201,
    "item": null,
    "starting": false
  },
  {
    "id": 203,
    "name": "On the River",
    "description": "The levee is directly north of here, and a small boat landing for Kate's Diner is to the south.  The river flows in an east west direction. ",
    "south": 150,
    "north": 49,
    "east": 204,
    "west": 202,
    "item": null,
    "starting": false
  },
  {
    "id": 204,
    "name": "On the River",
    "description": "You see the warehouse on the northern riverbank.  East of here the river passes under the eastern bridge and through the city wall. The banks of the  levee are west, in the direction of the current. ",
    "south": null,
    "north": null,
    "east": 205,
    "west": 203,
    "item": null,
    "starting": false
  },
  {
    "id": 205,
    "name": "On the River",
    "description": "The river enters from a hole in the eastern city wall.  The hole has been blocked by several vertically positioned iron bars set into the wall. Overhead you can see the stone buttresses of the eastern bridge. ",
    "south": null,
    "north": null,
    "east": null,
    "west": 204,
    "item": null,
    "starting": false
  },
  {
    "id": 250,
    "name": "Wall Road",
    "description": "Wall road extends north and south along the eastern walls of the city. The east gate is north of you, south is an intersection with a dark alley. You check to make sure you still have your wallet. ",
    "south": 251,
    "north": 41,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 251,
    "name": "Wall Road",
    "description": "You are walking along the eastern wall of the city, on a road extending  between the east gate and a bridge to the south.  A dark, dirty alley lies west  of here.  You step carefully around a pool of liquid...who knows what it could  be in a place this foul... ",
    "south": 252,
    "north": 250,
    "east": null,
    "west": 46,
    "item": null,
    "starting": false
  },
  {
    "id": 252,
    "name": "Wall Road",
    "description": "The walls of Midgaard tower above you to the east, keeping the city safe from its enemies...you hope.  An intersection with a dark alley lies north, and a bridge over the Midgaard river is south.  Beyond the bridge wall road  turns in the concourse. ",
    "south": 253,
    "north": 251,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 253,
    "name": "On the Bridge",
    "description": "You are crossing a strong stone bridge, which spans the Midgaard river. Below you, the river flows into an opening in the city wall, sealed with strong metal bars.  North of you is wall road, south of here the concourse loops around the inside of the city walls. ",
    "south": 104,
    "north": 252,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 254,
    "name": "The South Bridge",
    "description": "You are standing on a small, rickety bridge leading from the Midgaard City Dump to the much more attractive promenade of the southern parts of  Midgaard.  You can smell the stench of the dump to the north, the fresher air of the promenade seems preferable.  Below you are the swift-moving  currents of the Midgaard river. ",
    "south": 102,
    "north": 30,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 255,
    "name": "Inside the South Gate of Midgaard",
    "description": "Two strong stone towers surround a heavy wooden gate set into the city wall, to guard against the goblins that lurk in the southern forests.  You can exit the city to the south, if you dare, or walk down the concourse to the east or west. ",
    "south": 256,
    "north": null,
    "east": 129,
    "west": 128,
    "item": 365,
    "starting": false
  },
  {
    "id": 256,
    "name": "Outside the South Gate of Midgaard",
    "description": "You are standing outside the strong wooden gate on the southern walls of Midgaard.  Guards eye you suspiciously from the two towers on either side of the gate, as they stand watch to protect the city from the goblins of this forest.  The trees and goblins of the Miden'nir are south, the gate back to  Migaard lies north. ",
    "south": null,
    "north": 255,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 257,
    "name": "Wall Road",
    "description": "You are walking along wall road, just north of the west gate of Midgaard.   The road continues along the western wall to the north, towards an intersection with a busy Clan street. ",
    "south": 40,
    "north": 258,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 258,
    "name": "Wall Road",
    "description": "Wall road intersects with a crowded Clan Road here, filled with shops and artisans.  The street stretches off to the east, towards the far wall of the city.  Wall road continues to the north and south. ",
    "south": 257,
    "north": 259,
    "east": 301,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 259,
    "name": "Wall Road",
    "description": "You are walking along wall road, which extends along the inside of the western wall of Midgaard.  To the south, you can see an intersection with a crowded Clan street.  The northwestern corner of the city wall lies ahead to the north. ",
    "south": 258,
    "north": 260,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 260,
    "name": "The Northwest Corner",
    "description": "You are standing beneath the northwestern corner of the city wall, on a turn in wall road.  You can head south, towards the west gate, or east, to the  north gate. ",
    "south": 259,
    "north": null,
    "east": 261,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 261,
    "name": "Wall Road",
    "description": "The city walls tower over you as walk down wall road, between the northwestern corner of the wall to the west, and the northern gate of Midgaard to the east. ",
    "south": null,
    "north": null,
    "east": 262,
    "west": 260,
    "item": null,
    "starting": false
  },
  {
    "id": 262,
    "name": "Inside the North Gate of Midgaard",
    "description": "Two small towers surround a strong wooden gate, connected by a small stone bridge set with murder holes.  This gate is not as heavily guarded as the  others, as the plains outside are safe to travel.  You can leave midgaard to the north, or continues along wall road to the west and east.  A teeming clan street is visible to the south, and beyond that the graceful spires of the Temple of Mota, but there is no way to reach them from here. ",
    "south": null,
    "north": 268,
    "east": 263,
    "west": 261,
    "item": 365,
    "starting": false
  },
  {
    "id": 263,
    "name": "Wall Road",
    "description": "You are walking along wall road, between the northern gate of the city and the northeastern corner of the city walls.  You can see bloodstains on the road... better be on guard for thieves. ",
    "south": null,
    "north": null,
    "east": 264,
    "west": 262,
    "item": null,
    "starting": false
  },
  {
    "id": 264,
    "name": "The Northeast Corner",
    "description": "Wall road turns the corner here, as you pass by the northeastern edge of the city wall.  The north gate lies to your west, and the road south leads to the eastern gate of Midgaard. ",
    "south": 265,
    "north": null,
    "east": null,
    "west": 263,
    "item": null,
    "starting": false
  },
  {
    "id": 265,
    "name": "Wall Road",
    "description": "Just south of you is an intersection with a crowded clan street.  The  eastern wall of Midgaard is beside you, and to the north you can see the  northeast corner of the city wall. ",
    "south": 266,
    "north": 264,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 266,
    "name": "Wall Road",
    "description": "Here, wall road meets up with a busy clan street heading off towards the  west, and the far wall of the city.  You can smell spices, perfume, freshly cured hide, and other strange scents, all mingle together in one heady aroma. Wall road continues to the north and south. ",
    "south": 267,
    "north": 265,
    "east": null,
    "west": 316,
    "item": null,
    "starting": false
  },
  {
    "id": 267,
    "name": "Wall Road",
    "description": "You are near the center of wall road, just north of the east gate of the city. To the north, you can see an intersection with a crowded clan street. The guards at the gate eye you suspiciously from afar. ",
    "south": 41,
    "north": 266,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 268,
    "name": "Outside the North Gate of Midgaard",
    "description": "You stand outside the north gate of the walled city of Midgaard.  A dusty  trail is visibile to the north, it stretches around the walls of the city.   Further north are the wide expanses of the northern plains, leading to the  village of Ofcol.  You can return to Midgaard to the south. ",
    "south": 262,
    "north": null,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 270,
    "name": "On the Concourse",
    "description": "The strong stone walls of Midgaard rise up to the west, keeping evil at bay. The concourse heads towards a bridge to the north, and continues south  alongside a beautiful park. ",
    "south": 271,
    "north": 100,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 271,
    "name": "On the Concourse near the park",
    "description": "You are walking down the Concoruse, along the western wall of Midgaard.  To the north, the road passes by a beautiful park, to the south, you can see the southwest corner of the city wall. ",
    "south": 127,
    "north": 270,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 272,
    "name": "On the Concourse at Penny Lane",
    "description": "You are on a road leading around the inner walls of Midgaard.  To the north, the concourse heads towards a bridge into northern Midgaard.  To the south,  you can see an intersection with Elm Street.  The quaint paved streets of Penny Lane lie west. ",
    "south": 273,
    "north": 104,
    "east": null,
    "west": 140,
    "item": null,
    "starting": false
  },
  {
    "id": 273,
    "name": "On the Concourse at Elm Street",
    "description": "The air grows chill as you pass near the Elm Street graveyard.  The walls of Midgaard are to the east, and the concourse continues to the north and south. To your west, you see Elm Street at the graveyard entrance. ",
    "south": 130,
    "north": 272,
    "east": null,
    "west": 124,
    "item": null,
    "starting": false
  },
  {
    "id": 301,
    "name": "Clan Road",
    "description": "You are standing on the western end of Clan Road.  The traffic here   is light.  This is a quieter section of Midgaard.  You can hear the sound of haggling coming from the east. ",
    "south": null,
    "north": null,
    "east": 302,
    "west": 258,
    "item": null,
    "starting": false
  },
  {
    "id": 302,
    "name": "Clan Road",
    "description": "You are walking along Clan Road.  To the south of you is the money changer.   Clan Road continues on to the east and the west.   ",
    "south": null,
    "north": null,
    "east": 303,
    "west": 301,
    "item": null,
    "starting": false
  },
  {
    "id": 303,
    "name": "Clan Road",
    "description": "The shops on this stretch of Clan road are long-closed and boarded up. Not much traffic passes through this part, as there is nothing to buy.   ",
    "south": null,
    "north": null,
    "east": 314,
    "west": 302,
    "item": null,
    "starting": false
  },
  {
    "id": 314,
    "name": "Clan Road",
    "description": "Noise and light abound on this part of Clan Road.  Clan road continues off to the east and west. ",
    "south": null,
    "north": null,
    "east": 315,
    "west": 303,
    "item": null,
    "starting": false
  },
  {
    "id": 315,
    "name": "Clan Road",
    "description": "Clan Road seems to widen here slightly, allowing more traffic to  travel through the area.  To the south is another entrance to the busy pub.  This door is also open wide and spilling forth the sounds of happy patrons.  Clan Road continues to the east and west. ",
    "south": null,
    "north": null,
    "east": 316,
    "west": 314,
    "item": null,
    "starting": false
  },
  {
    "id": 316,
    "name": "Clan Road",
    "description": "You are at the eastern end of Clan Road.  To the east of you, the   tall wall around the city looms up before you and casts its shadow on you.  Clan Road continues to the west.   ",
    "south": null,
    "north": null,
    "east": 266,
    "west": 315,
    "item": null,
    "starting": false
  },
  {
    "id": 320,
    "name": "The Haunted Misty Entrance",
    "description": "The West Entrance to new beginnings now cloaked in a shroud of eerie mist. Cobwebs hang from the archway, and ghostly whispers beckon you forward. Pumpkins with sinister grins line the path, lighting the way with their eerie glow.",
    "south": 322,
    "north": 15,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 321,
    "name": "The East Haunted Passage",
    "description": "The East Entrance to true upcomings is now a haunted passage. Flickering lanterns cast long shadows that dance on the walls, and the sound of distant howls fills the air. The entrance is guarded by spectral figures that vanish as you approach, leaving a chilling breeze in their wake.",
    "south": 324,
    "north": 16,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 322,
    "name": "The Haunted Gym of Jenna",
    "description": "The haunted gym of elegance and mystery, where the air is thick with an unsettling stillness. Shadows move on their own, and ghostly figures dance in the dim candlelight. The scent of autumn leaves and candle wax fills the air, as eerie whispers echo through the hall.",
    "south": 326,
    "north": 320,
    "east": 323,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 323,
    "name": "The Spooky Gym of Jay",
    "description": "The spooky gym of vibrant power and serenity, now transformed into a realm of supernatural energy. The walls are adorned with glowing runes, and the floor is covered in a mist that swirls around your feet. Jack-o'-lanterns with flickering flames watch your every move, casting a warm yet eerie light.",
    "south": null,
    "north": null,
    "east": 324,
    "west": 322,
    "item": null,
    "starting": false
  },
  {
    "id": 324,
    "name": "The Phantom Gym of Derek",
    "description": "The phantom gym of vibrance and strength, where the atmosphere is charged with eerie energy. Phantasmal flames flicker along the walls, casting ghostly shadows that seem to move on their own. The air hums with a spectral power, and the floor is etched with ancient runes that glow with an unearthly light.",
    "south": null,
    "north": 321,
    "east": 325,
    "west": 323,
    "item": null,
    "starting": false
  },
  {
    "id": 325,
    "name": "Enchanted Gym of Mai",
    "description": "The enchanted gym of harmony and energy, transformed into a mystical haven. The walls are covered in ivy and glowing fungi, casting a soft, eerie light. The air is filled with the scent of night-blooming flowers, and the soft hum of unseen creatures adds to the otherworldly ambiance. Wisps of ethereal light float through the air, guiding your path.",
    "south": 329,
    "north": null,
    "east": null,
    "west": 324,
    "item": null,
    "starting": false
  },
  {
    "id": 326,
    "name": "The Haunted Tech Gym of Gio",
    "description": "The haunted gym of the tech-savvy wonder, where technology meets the supernatural. Flickering screens display ghostly images, and mechanical sounds echo through the dimly lit space. Cobwebs hang from the high-tech equipment, and eerie green lights pulse with a life of their own. The hum of haunted machinery fills the air, creating an atmosphere of eerie innovation.",
    "south": 330,
    "north": 322,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 327,
    "name": "The Cursed Gym of Sidharth",
    "description": "The cursed gym of legendary power and energy, where ancient magic intertwines with a haunting aura. The walls are covered in dark, foreboding runes that glow with a sinister light, and the air is heavy with the scent of old tomes and forgotten spells. Ghostly apparitions of legendary Pokmon drift through the shadows, and the ground is etched with symbols that pulse with cursed energy. The very air crackles with an ominous power, warning of the dark forces at play.",
    "south": 331,
    "north": null,
    "east": 328,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 328,
    "name": "The Enchanted Grove Gym of Sahil",
    "description": "The enchanted grove gym of elegance and nature, now shrouded in an eerie, mystical forest. The air is filled with the haunting melody of nocturnal creatures and the rustling of leaves. Glowing mushrooms and bioluminescent plants light the path, while twisted vines and gnarled branches create shadowy figures. The scent of damp earth and old wood adds to the mystical, haunting atmosphere.",
    "south": 340,
    "north": null,
    "east": 329,
    "west": 327,
    "item": null,
    "starting": false
  },
  {
    "id": 329,
    "name": "The Infernal Gym of Jared",
    "description": "The infernal gym of fire and serenity, transformed into a fiery, haunted arena. The walls flicker with the glow of ghostly flames, casting eerie shadows that dance in the dim light. The air is thick with the scent of smoke and ash, and the ground is cracked with glowing embers. Phantom flames lick the walls, creating an otherworldly atmosphere where fire and spectral calm coexist.",
    "south": null,
    "north": 325,
    "east": null,
    "west": 328,
    "item": null,
    "starting": false
  },
  {
    "id": 330,
    "name": "The Southern Haunted Domain",
    "description": "The South Entrance to the mighty Gio is a gateway to a haunted domain. The path is lined with dead trees that reach out like skeletal hands, and the ground is covered in fallen leaves that crunch underfoot. An ominous fog rolls in, obscuring the way forward, while eerie eyes watch from the darkness.",
    "south": 26,
    "north": 326,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 331,
    "name": "The Phantom Aviary Gym of Ronit",
    "description": "The phantom aviary gym of flight and strength, where the air is filled with an eerie, supernatural wind. Ghostly birds with glowing eyes perch on skeletal branches, and the walls are adorned with feathers that shimmer with an ethereal light. The floor is covered in a mist that swirls around your feet, and the distant sound of wingbeats echoes through the hall, creating a haunting atmosphere of ghostly flight and power.",
    "south": null,
    "north": 327,
    "east": 340,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 340,
    "name": "The Creepy Hallway",
    "description": "You're approaching the backrooms, a place of unsettling quiet and lurking shadows. The walls are covered in faded, peeling wallpaper, and the dim lighting flickers as if struggling against an unseen force. The air is thick with the scent of mildew and decay, and the floor creaks ominously underfoot. Strange, ghostly noises can be heard in the distance, adding to the sense of dread and disorientation.",
    "south": 342,
    "north": 328,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 341,
    "name": "The Fury Forge Gym of Waqar",
    "description": "The Fury Forge gym of wrath, where echoes of anger and fury linger in the air like a spectral storm. The walls are etched with ancient runes that pulse with a fiery red glow, reflecting the intensity of unresolved emotions. Shadows twist and writhe on the walls, shaped by unseen forces that embody raw, unchecked power. The air crackles with an electric energy, hinting at the tempestuous battles within.",
    "south": 344,
    "north": null,
    "east": 324,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 342,
    "name": "The Enigmatic Backrooms",
    "description": "The enigmatic backroom, a place where secrets whisper in the shadows and mysteries lurk in every corner. The air is heavy with the scent of old books and dried herbs, and shelves filled with dusty artifacts line the walls. Soft, ghostly lights flicker in the darkness, illuminating forgotten treasures and eerie relics. The sound of soft footsteps echoes faintly, as if someoneor somethingis watching from the unseen depths.",
    "south": 345,
    "north": 340,
    "east": 343,
    "west": 341,
    "item": null,
    "starting": false
  },
  {
    "id": 343,
    "name": "The Enchanted Adventure Gym of Daniel",
    "description": "The enchanted adventure gym of grace and adventure, where the air shimmers with mystical energy. Ethereal lights dance along the walls, casting a warm, inviting glow. Ancient tapestries depicting heroic deeds flutter in a ghostly breeze, and the faint scent of exotic spices fills the air. The floor is adorned with intricate patterns that seem to shift underfoot, guiding you toward new horizons of discovery and courage.",
    "south": null,
    "north": null,
    "east": null,
    "west": 342,
    "item": null,
    "starting": false
  },
  {
    "id": 344,
    "name": "The Blazing Sanctuary Gym of Thinh",
    "description": "The Blaze Sanctuary gym of strength and adaptability, where the air pulses with the fiery essence of determination. Luminous torches line the walls, casting flickering shadows that dance with a life of their own. The floor is etched with ancient runes that shimmer with a warm, orange glow, guiding challengers through a maze of trials. The atmosphere resonates with the spirit of resilience and the thrill of overcoming challenges.",
    "south": null,
    "north": 341,
    "east": 357,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 345,
    "name": "The Tranquil Oasis Gym of Tamara",
    "description": "The tranquil oasis gym of serenity and inner balance, where the air is filled with a gentle, calming breeze. Soft, bioluminescent plants line the walls, casting a soothing glow that shifts in color like a tranquil sunset. Water trickles gently from unseen sources, creating a serene melody that echoes through the chamber. The floor is adorned with intricate patterns that evoke a sense of peace and harmony, inviting challengers to find their inner strength amidst the tranquility.",
    "south": 357,
    "north": 342,
    "east": null,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 357,
    "name": "The Cryptic Foyer",
    "description": "You're approaching the final boss, a place where mysteries linger and anticipation hangs in the air. The walls are lined with ancient scrolls and arcane symbols, hinting at knowledge hidden within. Soft, eerie lights flicker along the ceiling, casting shifting shadows that seem to whisper secrets. The atmosphere is charged with the excitement of discovery and the tension of impending challenge.",
    "south": 358,
    "north": 345,
    "east": null,
    "west": 344,
    "item": null,
    "starting": false
  },
  {
    "id": 358,
    "name": "The Mystical Lecture Hall",
    "description": "You step into The Mystical Lecture Hall, an expansive, dimly lit room where the air crackles with energy. Rows of wooden desks face a grand lectern, where ancient tomes and spellbooks are open to reveal their secrets. Soft candlelight flickers on the walls, illuminating shelves filled with curious artifacts and specimens preserved in jars. The air is filled with the scent of old parchment and the faint crackle of magical energy, creating an atmosphere of intellectual curiosity and mystical intrigue. At the center stands Professor Tricke, a seasoned trainer with an intimidating presence, flanked by his formidable Pokmon: the ancient Aerodactyl, the massive Snorlax, and the electrifying Zapdos. The atmosphere is thick with anticipation as Professor Tricke readies himself. The real question is whether you are ready for this ultimate showdown.",
    "south": null,
    "north": 357,
    "east": 359,
    "west": null,
    "item": null,
    "starting": false
  },
  {
    "id": 359,
    "name": "Professor Tricke's Teleportation Room",
    "description": "You step into Professor Tricke's Teleportation Room, a vast, eerie expanse where time and space seem to distort. The darkness is absolute, pierced only by faint, swirling lights that dance like distant stars. The air is cold and still, carrying an unsettling silence that amplifies every breath and footstep. An overwhelming sense of isolation and mystery envelops you, as if the very essence of the room is alive and watching, waiting for your next move. Each exit appears to warp you to different locations on the map.",
    "south": 1,
    "north": 49,
    "east": 11,
    "west": 358,
    "item": null,
    "starting": false
  }
]
